import pytest
import os
from src.Types import DataType
from src.XMLDataReader import XMLDataReader
from xml.etree import ElementTree


class TestTextDataReader:
    @pytest.fixture()
    def file_and_data_content(self) -> tuple[str, DataType]:

        text = """
        <?xml version="1.0" encoding="UTF-8" ?>
        <root>
            <ИвановИванИванович>
                <математика>67</математика>
                <литература>100</литература>
                <программирование>91</программирование>
            </ИвановИванИванович>
            <ПетровПетрПетрович>
                <математика>78</математика>
                <химия>87</химия>
                <социология>61</социология>
            </ПетровПетрПетрович>
            <ПановАртёмЯрославович>
                <математика>56</математика>
                <литература>67</литература>
                <программирование>78</программирование>
            </ПановАртёмЯрославович>
            <ИльинаСофьяДанииловна>
                <математика>68</математика>
                <литература>87</литература>
                <программирование>71</программирование>
            </ИльинаСофьяДанииловна>
            <МироновЮрийМихайлович>
                <математика>90</математика>
                <литература>67</литература>
                <программирование>98</программирование>
            </МироновЮрийМихайлович>
            <ЕфремоваАлинаДанииловна>
                <математика>78</математика>
                <литература>76</литература>
                <программирование>87</программирование>
            </ЕфремоваАлинаДанииловна>
            <СеминМатвейМаркович>
                <математика>89</математика>
                <литература>100</литература>
                <программирование>87</программирование>
            </СеминМатвейМаркович>
            <ЗыковаЕлизаветаГригорьевна>
                <математика>92</математика>
                <литература>76</литература>
                <программирование>96</программирование>
            </ЗыковаЕлизаветаГригорьевна>
            <МакароваЕлизаветаСвятославовна>
                <математика>87</математика>
                <литература>57</литература>
                <программирование>100</программирование>
            </МакароваЕлизаветаСвятославовна>
            <АндрееваДарьяКирилловна>
                <математика>87</математика>
                <литература>57</литература>
                <программирование>100</программирование>
            </АндрееваДарьяКирилловна>
        </root>
        """

        data = {
            "ИвановИванИванович": [
                ("математика", 67), ("литература", 100),
                ("программирование", 91)
            ],
            "ПетровПетрПетрович": [
                ("математика", 78), ("химия", 87), ("социология", 61)
            ],
            "ПановАртёмЯрославович": [
                ("математика", 56), ("литература", 67),
                ("программирование", 78)
            ],
            "ИльинаСофьяДанииловна": [
                ("математика", 68), ("литература", 87),
                ("программирование", 71)
            ],
            "МироновЮрийМихайлович": [
                ("математика", 90), ("литература", 67),
                ("программирование", 98)
            ],
            "ЕфремоваАлинаДанииловна": [
                ("математика", 78), ("литература", 76),
                ("программирование", 87)
            ],
            "СеминМатвейМаркович": [
                ("математика", 89), ("литература", 100),
                ("программирование", 87)
            ],
            "ЗыковаЕлизаветаГригорьевна": [
                ("математика", 92), ("литература", 76),
                ("программирование", 96)
            ],
            "МакароваЕлизаветаСвятославовна": [
                ("математика", 87), ("литература", 57),
                ("программирование", 100)
            ],
            "АндрееваДарьяКирилловна": [
                ("математика", 87), ("литература", 57),
                ("программирование", 100)
            ]
        }
        return text, data

    @pytest.fixture()
    def filepath_and_data(self, file_and_data_content: tuple[str, DataType],
                          tmpdir) -> tuple[str, DataType]:
        cwd = os.getcwd()
        p = os.path.join(cwd, 'data/data.xml')
        return str(p), file_and_data_content[1]

    def test_read(self, filepath_and_data:
                  tuple[str, DataType]) -> None:
        file_content = XMLDataReader().read(filepath_and_data[0])
        assert file_content == filepath_and_data[1]
